angular.module('Services.Product', [])
.factory("Product", function(){
	return {
		List: function(filters, callback){
			console.log(filters);
			setTimeout(function(){
				callback({
					code: 200,
					content: {
						"page": filters.page,
						"pageCount": 6,
						"products": [{
							"id": 1,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": true,
							"tours": [{
								"id": 1,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 2,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}, {
							"id": 2,
							"name": "法瑞意德13天11晚（AZ）·金色山口+少女峰",
							"hasMore": false,
							"tours": [{
								"id": 3,
								"date": "11/21",
								"price": 12999,
								"num": 2
							}, {
								"id": 4,
								"date": "12/18",
								"price": 12999,
								"num": 2
							}]
						}]
					}
				});
			}, 3000);
		}
	};
})
.factory("Tour", function(){
	return {
		Info: function(tourId, callback){
			setTimeout(function(){
				callback({
					code: 200,
					content: {
						id: 1,
						name: "五渔村+德法瑞意4国13天10晚（4钻）CZ FCO-CDG（华中区）",
						level: 3,
						startCity: "上海",
						num: 6,
						price: 12999,
						days: 12,
						features: ["免费wifi", "包机直飞"],
						tours: [{
							id: 1,
							date: "11/20"
						}, {
							id: 2,
							date: "12/10"
						}],
						summary: {
							recommends: "♫ 中国国际航空公司精选，轻松开始欧洲之旅，往返直飞!!!!\n♫ 新增包含门票游览项目：少女峰、塞纳河游船、凡尔赛宫、贡都拉游船\n♫ 安排图恩湖及布里恩湖之间的瑞士小镇—因特拉肯，登临瑞士唯一列入世界自然遗産的雪山—少女峰！\n♫ 巴黎游览卢浮宫（含讲解），凡尔赛宫，塞纳河游船，蒙帕纳斯大厦，真材实料\n♫ 特别安排威尼斯搭乘贡都拉游船，这是威尼斯特有的小船，水城中最具代表性的一种传统交通工具\n♫ 游览迪斯尼白雪公主城堡—新天鹅堡、时尚之都米兰"
						}
					}
				});
			}, 1000);
		},
		Trips: function(tourId, callback){
			setTimeout(function(){
				callback({
					code: 200,
					content: [{
						day: 1,
						title: "北京 - 巴厘岛",
						flight: "MU780 PEK/DPS 16:00/00:50",
						meals: "中餐 晚餐",
						hotel: "待定",
						desc: "今日搭乘东航航空公司国际航班途径上海转机前往美国西部城市洛杉矶。\n抵达后导游接机，【好莱坞星光大道】（不少于20分钟）--是条沿着美国好莱坞大道与藤街伸展的人行道，影迷们可以追寻到点点星迹，星光布道上排列着2000多镶铜的五角星，内有姓名和不同的图案，代表明星在电影，电视，广播，唱片及舞台表演方面的成就；【中国戏院】（外观不少于10分钟）--好莱坞大道上最吸引人的地方，这座剧院据说是建造者心仪中国文化而得名。【华特•迪士尼音乐厅】外观拍照留念，可以进入音乐厅大门内，但不进表演大厅（不少于20分钟），【斯坎普中心】是NBA“洛杉矶湖人队““洛杉矶快船队”的主场，也是冰球“国王队”的主场（不少于20分钟），晚餐后入住酒店休息调整时差。"
					}, {
						day: 2,
						title: "巴厘岛",
						flight: "",
						meals: "早餐 中餐 晚餐",
						hotel: "待定",
						desc: "早餐后，酒店办理退房手续，继续行程前往长滩（Long  Beach），长滩是洛杉矶南部的一个港口城市，城市的名字来源于9公里长的海岸线，以疗养胜地而闻名。您可在码头包船出海，出海区域应以看到海豹海鸟等海洋生物。之后前往长滩水族馆，在这巨大的水族馆里，你可以亲眼目睹生活在17个不同环境的栖息地的12，000种海洋动物和550种海洋植物，之后返回洛杉矶前往杜比剧院又称柯达剧院（Kodak  Theatre）位于美国加州好莱坞的好莱坞大道  (Hollywood  Blvd.)上，2001年11月9日启用，是奥斯卡金像奖颁奖礼的举行地点，在2002年开始成为奥斯卡的永久举行地。  柯达剧院是专门为奥斯卡颁奖礼而设计，可容纳3,400名观众，设有全美国其中一个最大的舞台。\n全部团员汇合，在杜比剧院享用盛大的晚会。\n晚餐后返回酒店入住"
					}]
				});
			}, 1000);
		},
		ExtendInfo: function(tourId, callback){
			setTimeout(function(){
				callback({
					code: 200,
					content: [{
						title: "预订须知",
						items: [{
							title: "出行警示及说明",
							desc: "1.本产品不接受在预订航次结束之日前已怀孕的客人及80岁以上的客人预定。\n2.18岁以下的客人需有成人陪同。"
						}]
					}, {
						title: "费用包含",
						items: [{
							title: "费用包含",
							desc: "1.往返经济舱机票、燃油附加费、机场建设费。\n2.行程所列酒店住宿及早餐费用，房型标准为2人标准间。\n3.行程中所列景点首道大门票，详见行程。\n4.行程所列餐食。午晚餐为团队标准中式餐或当地风味餐；\n5.旅游签证费用。\n6.包含导游、领队、司机服务费。\n7.保险一人一份，具体最终保险名称及相关信息请查看相关保险选项详情(如您最终付款时决定取消此项，则此项不在费用包含中)。\n8.关于境外旅游人身意外保险，所有75周岁以下客人报名，均赠送保险一份，75周岁以上客人建议自行购买符合自身身体状况及领馆要求的保险，也可由我公司代办（100rmb/份，费用另行收取）"
						}, {
							title: "费用不含",
							desc: "1.出入境个人物品海关征税，超重行李的托运费、保管费。\n2.因交通延阻、罢工、天气、飞机、机器故障、航班取消或更改时间等不可抗力原因所导致的额外费用。\n3.酒店内洗衣、理发、电话、传真、收费电视、饮品、烟酒等个人消费。\n4.当地参加的自费以及以上“费用包含”中不包含的其它项目。\n5.单房差。\n6.75周岁以上客人关于境外旅游人身意外保险，100rmb/份。"
						}]
					}, {
						title: "重要条款",
						items: [{
							title: "重要条款一",
							desc: "1.申根旅游签证(ADS)随团进出,不允许擅自离团。\n2.行程结束后，交还护照和登机牌配合销签。\n3.请遵守当地国际法律法规，文明出行。"
						}]
					}, {
						title: "注意事项",
						items: [{
							title: "注意事项一",
							desc: "1.导游会根据当地的实际情况，适当调整景点游览顺序，但不得减少游览时间；\n2.行程中城市间的公里数为直线距离，仅作为参考；\n3.行程中的景点游览时间，包括步行、游船、火车、观光排队等候等时间总和；\n4.本公司所不能控制之特殊情况下，如战争、政治动荡、天灾、恶劣天气、交通工具发生技术问题、罢工等，本公司有权在启程前或出发后取消或替换任何一个旅游项目，亦有权缩短或延长旅程。产生的额外支出或损失，根据旅游法及合同约定各自承担相应责任。"
						}]
					}]
				});
			}, 1000);
		},
		OwnExpense: function(){},
		VisaMaterial: function(){},
		TourList: function(productId, callback){
			setTimeout(function(){
				callback({
					code: 200,
					content: [{
						"id": 1,
						"date": "11/21",
						"price": 12999,
						"num": 2
					}, {
						"id": 2,
						"date": "12/18",
						"price": 12999,
						"num": 2
					}, {
						"id": 3,
						"date": "11/21",
						"price": 12999,
						"num": 2
					}, {
						"id": 4,
						"date": "12/18",
						"price": 12999,
						"num": 2
					}]
				});
			}, 5000);
		},
		Sales: function(){},
		SalesAll: function(){},
		Favorite: function(tourId){},
		FavoriteList: function(){}
	};
});